Revit 2018 API
Rebar.BaseFinishingTurns Property
 For a spiral, the number of finishing turns at the lower end of the spiral.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2009
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2018 and will be removed in the next version of Revit. We suggest you use the GetShapeDrivenAccessor().BaseFinishingTurns property instead.")]
public int BaseFinishingTurns { get; set; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2018 and will be removed in the next version of Revit. We suggest you use the GetShapeDrivenAccessor().BaseFinishingTurns property instead.")> _
Public Property BaseFinishingTurns As Integer
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2018 and will be removed in the next version of Revit. We suggest you use the GetShapeDrivenAccessor().BaseFinishingTurns property instead.")]
public:
property int BaseFinishingTurns {
	int get ();
	void set (int value);
}
Remarks
 Applies only to instances where RebarShape.Definition is of type RebarShapeDefinitionByArc, and its Type property is equal to the value RebarShapeDefinitionByArcType.Spiral.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: turns must be between 0 and 100.
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InvalidOperationException |  This Rebar is not an instance of a spiral shape. -or- This method applies only to shape driven rebar.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace